[Jedi X2SoldierClassTemplate]
+DisplayName="绝地武士"
+ClassSummary="绝地武士是银河共和国正义与和平的守护者。许多绝地沉醉于原力的黑暗面堕落为西斯。西斯是绝地教团的夙敌，数千年来他们展开了无数次宿命对决。"
+LeftAbilityTreeTitle="光明"
+RightAbilityTreeTitle="黑暗"
AbilityTreeTitles[0]="光明"
AbilityTreeTitles[1]="灰色"
AbilityTreeTitles[2]="黑暗"
AbilityTreeTitles[3]="暗影"


+RankNames[0]=
+RankNames[1]=新秀
+RankNames[2]=学徒
+RankNames[3]=武士
+RankNames[4]=守卫
+RankNames[5]=哨兵
+RankNames[6]=领事
+RankNames[7]=大师
+RankNames[8]=尊者

+ShortNames[0]=
+ShortNames[1]=新秀
+ShortNames[2]=学徒
+ShortNames[3]=武士
+ShortNames[4]=守卫
+ShortNames[5]=哨兵
+ShortNames[6]=领事
+ShortNames[7]=大师
+ShortNames[8]=尊者


+RankIcons[0]=""
+RankIcons[1]="JediClassUI.Ranks.rank_Initiate"
+RankIcons[2]="JediClassUI.Ranks.rank_Padawan"
+RankIcons[3]="JediClassUI.Ranks.rank_Knight"
+RankIcons[4]="JediClassUI.Ranks.rank_Guardian"
+RankIcons[5]="JediClassUI.Ranks.rank_Sentinel"
+RankIcons[6]="JediClassUI.Ranks.rank_Consular"
+RankIcons[7]="JediClassUI.Ranks.rank_Master"
+RankIcons[8]="JediClassUI.Ranks.rank_GrandMaster"

+RandomNickNames[0]=""
+RandomNickNames[1]=""
+RandomNickNames[2]=""
+RandomNickNames[3]=""
+RandomNickNames[4]=""
+RandomNickNames[5]=""
+RandomNickNames[6]=""
+RandomNickNames[7]=""
+RandomNickNames[8]=""
+RandomNickNames[9]=""
+RandomNickNames[10]=""
+RandomNickNames[11]=""
+RandomNickNames[12]=""
+RandomNickNames[13]=""
+RandomNickNames[14]=""
+RandomNickNames[15]=""

[Lightsaber_TR X2WeaponTemplate]
FriendlyName="练习光剑"
FriendlyNamePlural="练习光剑"
BriefSummary="这把练习光剑是用最基本的部件组成，实战中效果不佳。"
TacticalText="外观好看，但实战效果很差。"
AbilityDescName="光剑"

[Lightsaber_CV X2WeaponTemplate]
FriendlyName="光剑"
FriendlyNamePlural="光剑"
BriefSummary="光剑是更文明时代的高雅武器，而不像爆能枪那样笨拙或随意。"
TacticalText="<Bullet \>光剑是更文明时代的高雅武器，而不像爆能枪那样笨拙或随意。"
AbilityDescName="光剑"

[Lightsaber_MG X2WeaponTemplate]
FriendlyName="武士光剑"
FriendlyNamePlural="武士光剑"
BriefSummary="这是一把绝地武士的高级光剑。已加固过结构并增加线缆规格，以处理更高的能量输出。"
TacticalText="<Bullet \>这是一把绝地武士的高级光剑。已加固过结构并增加线缆规格，以处理更高的能量输出。"
AbilityDescName="光剑"

[Lightsaber_BM X2WeaponTemplate]
FriendlyName="大师光剑"
FriendlyNamePlural="大师光剑"
BriefSummary="这是一把威力巨大的绝地大师光剑。已进一步加固过结构，并且由于蕴含的能量巨大，而必须移除任何线缆屏蔽。"
TacticalText="<Bullet \>这是一把威力巨大的绝地大师光剑。已进一步加固过结构，并且由于蕴含的能量巨大，而必须移除任何线缆屏蔽。"
AbilityDescName="光剑"

[Saberstaff_TR X2WeaponTemplate]
+FriendlyName="练习剑杖"
+BriefSummary="这把练习剑杖是用最基本的部件组成，实战中效果不佳。"
+TacticalText="<Bullet/>这把练习剑杖是用最基本的部件组成，实战中效果不佳。"
+AbilityDescName="剑杖"

[Saberstaff_CV X2WeaponTemplate]
+FriendlyName="学徒剑杖"
+BriefSummary="这柄基础剑杖发出被卡特赛水晶过滤的光束。它比剑更有效，是学徒的适用武器。"
+TacticalText="<Bullet/>剑杖是一种难以驾驭的武器，能用其变幻莫测的招式，出其不意地毁灭打击对手。"
+AbilityDescName="剑杖"

[Saberstaff_MG X2WeaponTemplate]
+FriendlyName="武士剑杖"
+BriefSummary="这柄剑杖用阿德根水晶的芒修特品种与原力相协调，让使用者的武器和原力之间建立羁绊。该武器适用于老练的武士。"
+TacticalText="<Bullet/>剑杖是一种难以驾驭的武器，能用其变幻莫测的招式，出其不意地毁灭打击对手。\n<Bullet/>穿甲1点。"
+AbilityDescName="剑杖"

[Saberstaff_BM X2WeaponTemplate]
+FriendlyName="大师剑杖"
+BriefSummary="这柄剑杖用凯伯水晶强化而成，这是最稀有、最强大的光剑水晶。其使用者可显著增强与原力的亲和力，从而在战斗中更具威力。该武器适用于大师。"
+TacticalText="<Bullet/>剑杖是一种难以驾驭的武器，能用其变幻莫测的招式，出其不意地毁灭打击对手。\n<Bullet/>穿甲2点。"
+AbilityDescName="剑杖"

[Holocron_CV X2WeaponTemplate]
FriendlyName="全息记录仪"
FriendlyNamePlural="全息记录仪"
BriefSummary="全息记录仪是绝地教团和西斯所使用的信息存储设备，以全息形式保存古老知识或宝贵信息。它们是看似手掌大小的发光多面体，由晶体材料和硬件组成，并只能用原力来激活和使用。"
TacticalText="全息记录仪是绝地教团和西斯所使用的信息存储设备，以全息形式保存古老知识或宝贵信息。它们是看似手掌大小的发光多面体，由晶体材料和硬件组成，并只能用原力来激活和使用。"
AbilityDescName="全息记录仪"

[Holocron_MG X2WeaponTemplate]
FriendlyName="武士全息记录仪"
FriendlyNamePlural="武士全息记录仪"
BriefSummary="全息记录仪是绝地教团和西斯所使用的信息存储设备，以全息形式保存古老知识或宝贵信息。它们是看似手掌大小的发光多面体，由晶体材料和硬件组成，并只能用原力来激活和使用。"
TacticalText="全息记录仪是绝地教团和西斯所使用的信息存储设备，以全息形式保存古老知识或宝贵信息。它们是看似手掌大小的发光多面体，由晶体材料和硬件组成，并只能用原力来激活和使用。"
AbilityDescName="全息记录仪"

[Holocron_BM X2WeaponTemplate]
FriendlyName="大师全息记录仪"
FriendlyNamePlural="大师全息记录仪"
BriefSummary="全息记录仪是绝地教团和西斯所使用的信息存储设备，以全息形式保存古老知识或宝贵信息。它们是看似手掌大小的发光多面体，由晶体材料和硬件组成，并只能用原力来激活和使用。"
TacticalText="全息记录仪是绝地教团和西斯所使用的信息存储设备，以全息形式保存古老知识或宝贵信息。它们是看似手掌大小的发光多面体，由晶体材料和硬件组成，并只能用原力来激活和使用。"
AbilityDescName="全息记录仪"


[BattlePrecognition X2AbilityTemplate]
LocFriendlyName="战斗感知"
LocFlyOverText="战斗感知"
LocLongDescription="对近战范围内试图进攻的任何敌人，进行先发制人的跳跃攻击。"
LocHelpText="对近战范围内试图进攻的任何敌人，进行先发制人的跳跃攻击。"
LocPromotionPopupText="<Bullet/>对近战范围内试图进攻的任何敌人，进行先发制人的跳跃攻击。"

[BattlePrecognitionLeapStrike X2AbilityTemplate]
LocFriendlyName="战斗感知"
LocFlyOverText="战斗感知"
LocLongDescription="近战监视在蓝色移动范围内的敌人。"
LocHelpText="近战监视在蓝色移动范围内的敌人。"
LocPromotionPopupText="<Bullet/>近战监视在蓝色移动范围内的敌人。"
LocHitMessage="战斗感知"

[ForceJump X2AbilityTemplate]
LocFriendlyName="原力飞跃"
LocFlyOverText="原力飞跃"
LocLongDescription="借助原力跳跃很远的距离。"
LocHelpText="借助原力跳跃很远的距离。"
LocPromotionPopupText="<Bullet/>借助原力跳跃很远的距离。"

[ForceChoke X2AbilityTemplate]
LocFriendlyName="原力锁喉"
LocFlyOverText="原力锁喉"
LocLongDescription="用远方的黑暗力量，隔空扼死敌人。<Ability:ForceAlignment/>"
LocHelpText="用远方的黑暗力量，隔空扼死敌人。"
LocPromotionPopupText="<Bullet/>用远方的黑暗力量，隔空扼死敌人。<br /><Bullet/><Ability:ForceAlignment/>"

[ForceLightning X2AbilityTemplate]
LocFriendlyName="原力闪电"
LocFlyOverText="原力闪电"
LocLongDescription="引导你的恨意和怒火，释放出威力强大的原力闪电。<Ability:ForceAlignment/>"
LocHelpText="引导你的恨意和怒火，释放出威力强大的原力闪电。"
LocPromotionPopupText="<Bullet/>将在一次成功的自身灵能与目标意志对抗后，才会造成伤害。<br /><Bullet/>这也能针对平民或盟友攻击，但会使你的原力面朝黑暗倾斜。<br /><Bullet/><Ability:ForceAlignment/>"

[ForceChainLightning X2AbilityTemplate]
LocFriendlyName="连锁闪电"
LocFlyOverText="连锁闪电"
LocLongDescription="引导你的恨意和怒火，释放出威力强大的原力闪电，击中多个敌人。<Ability:ForceAlignment/>"
LocHelpText="引导你的恨意和怒火，释放出威力强大的原力闪电，击中多个敌人。"
LocPromotionPopupText="<Bullet/>对在你的灵能与意志对抗失败的所有单位造成伤害。<br /><Bullet/>这也能针对平民或盟友攻击，但会使你的原力面朝黑暗倾斜。<br /><Bullet/><Ability:ForceAlignment/>"

[ForcePush X2AbilityTemplate]
LocFriendlyName="原力推击"
LocFlyOverText="原力推击"
LocLongDescription="用原力将目标推离原位。这种基础原力会必定命中目标，可移除监视，有几率击晕目标，并造成极少伤害。<Ability:ForceAlignment/>"
LocHelpText="用原力将目标推离原位。这种基础原力会必定命中目标，可移除监视，有几率击晕目标，并造成极少伤害。"
LocPromotionPopupText="<Bullet/>可造成击晕。<br /><Bullet/>移除监视和毒蛇捆绑。<br /><Bullet/>不会结束回合。<br /><Bullet/>必定命中。<br /><Bullet/>有<Ability:Cooldown< />回合冷却。<br /><Bullet/><Ability:ForceAlignment/>"

[ForceWind X2AbilityTemplate]
LocFriendlyName="原力狂风"
LocFlyOverText="原力狂风"
LocLongDescription="用原力将多个目标推离原位，并造成环境破坏。这种高级原力会必定命中目标，可移除监视，有几率击晕目标，并造成一些伤害。<Ability:ForceAlignment/>"
LocHelpText="用原力将多个目标推离原位，并造成环境破坏。这种高级原力会必定命中目标，可移除监视，有几率击晕目标，并造成一些伤害。"
LocPromotionPopupText="<Bullet/>可造成击晕。<br /><Bullet/>移除监视和毒蛇捆绑。<br /><Bullet/>必定命中。<br /><Bullet/>有<Ability:Cooldown< />回合冷却。<br /><Bullet/><Ability:ForceAlignment/>"

[ForceJumpTraversal X2AbilityTemplate]
LocFriendlyName="原力跳跃"
LocFlyOverText="原力跳跃"
LocLongDescription="绝地武士可借助原力跳跃到难以置信的高处。"
LocHelpText="绝地武士可借助原力跳跃到难以置信的高处。"
LocPromotionPopupText="<Bullet/>允许不借助梯子或升降通道而跳上高处。"

[MindTricks X2AbilityTemplate]
LocFriendlyName="绝地心控"
LocFlyOverText="绝地心控"
LocLongDescription="影响弱者的心灵，将其移动力、视野和察觉范围减少到零。这种原力不会打破隐蔽。<Ability:ForceAlignment/>"
LocHelpText="影响弱者的心灵，将其移动力、视野和察觉范围减少到零。这种原力不会打破隐蔽。"
LocFlyOverText="绝地心控"
LocMissMessage="绝地心控失败"
LocPromotionPopupText="<Bullet/>影响锥形区域内的目标，如果成功，可将移动力、视野和察觉范围减少到零。这种原力不会打破隐蔽。<br /><Bullet/>有<Ability:Cooldown< />回合冷却。<br /><Bullet/><Ability:ForceAlignment/>"

[ForceHeal X2AbilityTemplate]
LocFriendlyName="原力治疗"
LocFlyOverText="原力治疗"
LocLongDescription="用原力治疗自己或盟友。同时移除负面状态效果，并为队友止血。<Ability:ForceAlignment/>"
LocHelpText="用原力治疗自己或盟友。同时移除负面状态影响，并为队友止血。"
LocPromotionPopupText="<Bullet/>治疗单位。<br /><Bullet/>治疗目标。<br /><Bullet/>移除负面状态效果。<br /><Bullet/>救助失去意识和流血的目标。<br /><Bullet/>用原力治疗队友，会使你的原力面朝光明倾斜。<br /><Bullet\><Ability:ForceAlignment/>"

[MindControl X2AbilityTemplate]
LocFriendlyName="心灵控制"
LocFlyOverText="心灵控制"
LocLongDescription="获得对盟友和敌人的完全控制权。<Ability:ForceAlignment/>"
LocHelpText="获得对盟友和敌人的完全控制权。"
LocPromotionPopupText="<Bullet/>获得对盟友和敌人的完全控制权。<br/><Bullet/>这也能针对平民或盟友攻击，但会使你的原力面朝黑暗倾斜。<br/><Bullet/><Ability:ForceAlignment/>"

[ForceSpeed X2AbilityTemplate]
LocFriendlyName="原力超动"
LocFlyOverText="原力超动"
LocLongDescription="本回合可进行三次行动，用完前的任何行动都不会结束回合。"
LocHelpText="本回合可进行三次行动，用完前的任何行动都不会结束回合。"
LocPromotionPopupText="<Bullet/>本回合可进行三次行动，用完前的任何行动都不会结束回合。</br>"

[ForceFear X2AbilityTemplate]
LocFriendlyName="原力惊惧"
LocFlyOverText="原力惊惧"
LocLongDescription="施放者直击目标的心灵最深处，引起无法抵抗的战栗，严重影响目标的各种能力。这种原力如此不易察觉，不会打破隐蔽。<Ability:ForceAlignment/>"
LocHelpText="施放者直击目标的心灵最深处，引起无法抵抗的战栗，严重影响目标的各种能力。这种原力如此不易察觉，以至于不会打破隐蔽。"
LocPromotionPopupText="<Bullet/>锥形区域攻击，可引起有机敌人恐慌。</br><Bullet/>不打破隐蔽。</br><Bullet/>这也能针对平民或盟友攻击，但会使你的原力面朝黑暗倾斜。<br /><Bullet/><Ability:ForceAlignment/>"

[LeapStrike X2AbilityTemplate]
LocFriendlyName="跃袭斩"
LocFlyOverText="跃袭斩"
LocLongDescription="绝地武士使用原力跳跃到目标面前并迅速用光剑攻击，不会触发反应火力。"
LocHelpText="绝地武士使用原力跳跃到目标面前并迅速用光剑攻击，不会触发反应火力。"
LocPromotionPopupText="<Bullet/>绝地武士使用原力跳跃到目标面前并迅速用光剑攻击，不会触发反应火力。</br>"

[LeapStrikeFleche X2AbilityTemplate]
LocFriendlyName="跃袭斩加成"
LocFlyOverText="跃袭斩"
LocLongDescription="绝地武士根据使用跃袭斩的起步位置到目标之间的距离获得伤害加成。"
LocHelpText="绝地武士根据使用跃袭斩的起步位置到目标之间的距离获得伤害加成。"

[LightsaberSlash X2AbilityTemplate]
LocFriendlyName="光剑斩杀"
LocFlyOverText="光剑斩杀"
LocLongDescription="使用光剑攻击邻近的目标，消耗1行动点。"
LocHelpText="使用光剑攻击邻近的目标，消耗1行动点。"
LocPromotionPopupText="<Bullet/>使用光剑攻击邻近的目标。<br/><Bullet/>消耗1行动点，不会自动结束回合，所以一回合可使用2次。"

[EnergyAbsorption X2AbilityTemplate]
LocFriendlyName="吸能护盾"
LocFlyOverText="吸能护盾"
LocLongDescription="你擅长用原力吸收来袭火力的能量。获得5能量护盾。"
LocHelpText="你擅长用原力吸收来袭火力的能量。获得5能量护盾。"
LocPromotionPopupText="<Bullet/>获得5能量护盾。</br>"

[BattleMeditation X2AbilityTemplate]
LocFriendlyName="战斗冥想"
LocFlyOverText="战斗冥想"
LocLongDescription="激活后，绝地武士可偏斜或反射每一次来袭的射击。<Ability:ForceAlignment/>"
LocHelpText="激活后，绝地武士可偏斜或反射每一次来袭的射击。"
LocPromotionPopupText="<Bullet/>在一敌方回合内无限次偏斜/反射。</br><Bullet/><Ability:ForceAlignment/>"

[MindControl X2AbilityTemplate]
LocFriendlyName="心智支配"
LocLongDescription="对一名敌人永久心灵控制。每个任务只能成功施放一次[支配]。"
LocHelpText="对一名敌人永久心灵控制。每个任务只能成功施放一次[支配]。"
LocFlyOverText="心智支配"
LocMissMessage="心智支配失败"
LocPromotionPopupText="<Bullet/>支配需要灵能者的灵能值与目标的意志力进行对抗并成功。<br/><Bullet/>如果支配失败，则再次支配之前，将有4回合冷却。<br/><Bullet/>如果灵能者死亡或离开战场，则支配会失效。<br/>"

[ForceSense X2AbilityTemplate]
LocFriendlyName="原力感知"
LocLongDescription="当没有视野时，也能感知附近的单位。也可暴露在隐藏和钻地的敌人。"
LocHelpText="当没有视野时，也能感知附近的单位。也可暴露在隐藏和钻地的敌人。"
LocFlyOverText="原力感知"
LocPromotionPopupText="<Bullet/>感知正常视野范围外的敌人。<br/><Bullet/>也可暴露在隐藏和钻地的敌人。<br/>"

[ForceProtection X2AbilityTemplate]
LocFriendlyName="原力防护"
LocLongDescription="这是一种高等级绝地武士才可获得的能力，原力将会保护绝地武士免受火、毒、酸以及爆炸伤害。"
LocHelpText="绝地武士获得对火、毒、酸以及爆炸伤害的免疫。"
LocFlyOverText="原力防护"
LocPromotionPopupText="<Bullet/>获得原力防护能力的绝地武士，可安全地穿越火、毒、酸等危险环境。<br/>"

[Slash_LW X2AbilityTemplate]
LocFriendlyName="斩杀"
LocFlyOverText="斩杀"
LocLongDescription="用剑攻击邻近的目标，消耗1行动点。"
LocHelpText="用剑攻击邻近的目标，消耗1行动点。"
LocPromotionPopupText="<Bullet/>用剑攻击邻近的目标。<br/><Bullet/>消耗1行动点，不会自动结束回合，所以一回合可使用2次。"

[ForceDrain X2AbilityTemplate]
LocFriendlyName="原力吸血"
LocFlyOverText="原力吸血"
LocLongDescription="吸取你周围目标的生命来治疗自己。<Ability:ForceAlignment/>"
LocHelpText="吸取你周围目标的生命来治疗自己。"
LocPromotionPopupText="<Bullet/>以你为中心的范围效果技能。<br /><Bullet/>每造成敌人1点伤害，恢复你1点生命值。<br /><Bullet/><Ability:ForceAlignment/>"

[LightsaberDeflect X2AbilityTemplate]
LocFriendlyName="光剑偏斜"
LocLongDescription="绝地武士使用<Ability:WeaponName/>有几率偏斜来袭的射击。"
LocHelpText="绝地武士使用<Ability:WeaponName/>有几率偏斜来袭的射击。"
LocFlyOverText="光剑偏斜"
LocPromotionPopupText="<Bullet/>绝地武士使用<Ability:WeaponName/>有几率偏斜来袭的射击。"

[LightsaberReflect X2AbilityTemplate]
LocFriendlyName="光剑反射"
LocLongDescription="绝地武士使用<Ability:WeaponName/>有几率将来袭射击反射给攻击者，或者直接将其偏斜。"
LocHelpText="绝地武士使用<Ability:WeaponName/>有几率将来袭射击反射给攻击者，或者直接将其偏斜。"
LocFlyOverText="光剑反射"
LocPromotionPopupText="<Bullet/>绝地武士使用<Ability:WeaponName/>有几率将来袭射击反射给攻击者，或者直接将其偏斜。"

[LightsaberToss X2AbilityTemplate]
LocFriendlyName="光剑飞空"
LocLongDescription="向敌人投掷光剑，并用原力回收。"
LocHelpText="向敌人投掷光剑，并用原力回收。"
LocFlyOverText="光剑飞空"
LocPromotionPopupText="<Bullet/>"

[LightsaberTelekinesis X2AbilityTemplate]
LocFriendlyName="光剑空舞"
LocLongDescription="向所有可见的敌人投掷光剑，并用原力回收。"
LocHelpText="向所有可见的敌人投掷光剑，并用原力回收。"
LocFlyOverText="光剑大师"
LocPromotionPopupText="<Bullet/>"

[ForcePowerPool X2AbilityTemplate]
LocFriendlyName="原力法渠"
LocLongDescription="测量绝地武士对生命原力的协调度，这决定他们可使用的最大原力。"
LocHelpText="测量绝地武士对生命原力的协调度，这决定他们可使用的最大原力。"
LocFlyOverText="原力法渠"
LocPromotionPopupText="<Bullet/>绝地武士在战斗开始时，会根据等级获得相应的原力点。"

[ForceMeditate X2AbilityTemplate]
LocFriendlyName="原力冥想"
LocLongDescription="进入自我催眠，重新调整与原力的联系，此时你将更容易受伤。这种冥想可移除负面精神状态，如混乱和眩晕。"
LocHelpText="进入自我催眠，重新调整与原力的联系，此时你将更容易受伤。这种冥想可移除负面精神状态，如混乱和眩晕。"
LocFlyOverText="原力冥想"
LocPromotionPopupText="<Bullet/>充满所有原力点。<br /><Bullet/>在下一回合开始前，将失去闪避能力。<br /><Bullet/>移除负面精神状态，如混乱和眩晕。"

[ForcePoolBonusDamage X2AbilityTemplate]
LocFriendlyName="原力法渠"

[HolocronPool_CV X2AbilityTemplate]
LocFriendlyName="学徒全息记录仪"
LocLongDescription="携带学徒全息记录仪的绝地士兵，将与原力的协调度更高，可获得33%的原力点加成。"
LocHelpText="绝地携带学徒全息记录仪，将与原力的协调度更高，可获得33%的原力点加成。"

[HolocronPool_MG X2AbilityTemplate]
LocFriendlyName="武士全息记录仪"
LocLongDescription="携带武士全息记录仪的绝地士兵，相比学徒的协调度更高，可获得66%的原力点加成。"
LocHelpText="携带武士全息记录仪的绝地士兵，相比学徒的协调度更高，可获得66%的原力点加成。"

[HolocronPool_BM X2AbilityTemplate]
LocFriendlyName="大师全息记录仪"
LocLongDescription="大师全息记录仪是领事引导原力的重要法宝，可获得100%的原力点加成。"
LocHelpText="大师全息记录仪是领事引导原力的重要法宝，可获得100%的原力点加成。"

[DeflectBonusSaberStaff_CV X2AbilityTemplate]
LocFriendlyName="增强偏斜"
LocLongDescription="剑杖的双剑结构，获得+10%的偏斜加成。"
LocHelpText="剑杖的双剑结构，获得+10%的偏斜加成。"

[DeflectBonusSaberStaff_MG X2AbilityTemplate]
LocFriendlyName="增强偏斜"
LocLongDescription="剑杖的双剑结构，获得+15%的偏斜加成。"
LocHelpText="剑杖的双剑结构，获得+15%的偏斜加成。"

[DeflectBonusSaberStaff_BM X2AbilityTemplate]
LocFriendlyName="增强偏斜"
LocLongDescription="剑杖的双剑结构，获得+20%的偏斜加成。"
LocHelpText="剑杖的双剑结构，获得+20%的偏斜加成。"

[UpgradeDiamond_Bsc X2WeaponUpgradeTemplate]
FriendlyName="金刚石"
FriendlyNamePlural="金刚石"
BriefSummary="这种普通的钻石不足以替代真正的光剑水晶，但除非我们从外星人那里夺取，否则我们别无他选。"
TinySummary="增加伤害"

[UpgradeAdeganCrystal_Bsc X2WeaponUpgradeTemplate]
FriendlyName="阿德根水晶"
FriendlyNamePlural="阿德根水晶"
BriefSummary="阿德根水晶，也称为伊冷水晶，是最常见的光剑聚能水晶之一。"
TinySummary=""

[UpgradeAnkarresSapphire_Adv X2WeaponUpgradeTemplate]
FriendlyName="安卡雷斯蓝宝石"
FriendlyNamePlural="安卡雷斯蓝宝石"
BriefSummary="这种水晶具有传奇般的治疗能力和许多其他效果。它是可用于制作光剑的最强大的水晶之一。"
TinySummary=""

[UpgradeBarabOreIngot_Adv X2WeaponUpgradeTemplate]
FriendlyName="巴拉布矿锭"
FriendlyNamePlural="巴拉布矿锭"
BriefSummary="当它置于光剑中，受到大量辐射后，将产生一种燃烧到几乎失去内聚力的光刃。"
TinySummary=""

[UpgradeBondarCrystal_Adv X2WeaponUpgradeTemplate]
FriendlyName="邦达尔水晶"
FriendlyNamePlural="邦达尔水晶"
BriefSummary="这种水晶开采于环绕奥德朗星系的远轨道小行星。它会产生一种能量不稳定的光刃，在撞击时发出脉冲，有几率击晕对手。"
TinySummary=""

[UpgradeDamindCrystal_Bsc X2WeaponUpgradeTemplate]
FriendlyName="达明水晶"
FriendlyNamePlural="达明水晶"
BriefSummary="这种水晶发现于达米尼亚的沙漠区域。它会产生一种具有清晰轮廓、略微加长加宽的光刃。"
TinySummary=""

[UpgradeDragiteCrystal_Bsc X2WeaponUpgradeTemplate]
FriendlyName="德雷吉特水晶"
FriendlyNamePlural="德雷吉特水晶"
BriefSummary="这种水晶发现于姆哈利的达洛普山脉。用它产生的光刃，在撞击时发出巨大共振，造成轻微的声波伤害。"
TinySummary=""

[UpgradeEralamCrystal_Adv X2WeaponUpgradeTemplate]
FriendlyName="埃拉兰水晶"
FriendlyNamePlural="埃拉兰水晶"
BriefSummary="这种水晶曾经开采于埃拉兰的第三个月亮，古代西斯人的轰炸毁灭了大部分遗存。如果能找到并使用这些水晶，会产生一种清晰、优质的光刃。"
TinySummary=""

[UpgradeFirkrannCrystal_Sup X2WeaponUpgradeTemplate]
FriendlyName="菲尔克兰水晶"
FriendlyNamePlural="菲尔克兰水晶"
BriefSummary="这种沉重的水晶由拉法五号的当地人收集。如果用于光剑制造，会产生一种对机器人有破坏力的带电光刃。"
TinySummary=""

[UpgradeHurrikaineCrystal_Sup X2WeaponUpgradeTemplate]
FriendlyName="霍拉凯水晶"
FriendlyNamePlural="霍拉凯水晶"
BriefSummary="非常稀有的霍拉凯水晶以其无与伦比的美丽而闻名。在光剑中使用时，这种黑宝石会产生一种有破坏力的光刃，可穿透部分防御。"
TinySummary=""

[UpgradeJenruaxCrystal_Sup X2WeaponUpgradeTemplate]
FriendlyName="詹姆克斯水晶"
FriendlyNamePlural="詹姆克斯水晶"
BriefSummary="这种水晶由奥皮拉精炼而成，已去除了所有杂质。当用于光剑制造时，会产生一种又准又快的光刃。"
TinySummary=""

[UpgradeKaiburrCrystal_Adv X2WeaponUpgradeTemplate]
FriendlyName="凯布尔水晶"
FriendlyNamePlural="凯布尔水晶"
BriefSummary="凯布尔宝石或许是可用到的最强大的光剑水晶，它能赋予拥有者洞察力和勇气。"
TinySummary=""

[UpgradeKashaCrystal_Bsc X2WeaponUpgradeTemplate]
FriendlyName="卡沙水晶"
FriendlyNamePlural="卡沙水晶"
BriefSummary="这种水晶是锡瑞亚人的传统冥想工具。当用作光剑水晶时，即使在紧张战斗中，它也能清除使用者被分散的注意力。"
TinySummary=""

[UpgradeLorrdianGemstone_Bsc X2WeaponUpgradeTemplate]
FriendlyName="洛尔迪安宝石"
FriendlyNamePlural="洛尔迪安宝石"
BriefSummary="在被征服时期，洛尔迪安人被禁止彼此交谈，因此学会用微妙手势和嘀嗒声来交流。这些宝石就带有这种能力。"
TinySummary=""

[UpgradeNextorCrystal_Bsc X2WeaponUpgradeTemplate]
FriendlyName="尼克斯特水晶"
FriendlyNamePlural="尼克斯特水晶"
BriefSummary="这种水晶开采于姆哈利星球的山脉。当用于光剑制造时，会产生一种能量不稳定的光刃，可造成惊人的伤害量。"
TinySummary=""

[UpgradeOpilaCrystal_Sup X2WeaponUpgradeTemplate]
FriendlyName="奥皮拉水晶"
FriendlyNamePlural="奥皮拉水晶"
BriefSummary="这种水晶发现于费罗斯星系的小行星环带。它可用来制造光剑，会产生强烈的光刃，应该能进行快速切割。"
TinySummary=""

[UpgradePhondCrystal_Bsc X2WeaponUpgradeTemplate]
FriendlyName="菲德水晶"
FriendlyNamePlural="菲德水晶"
BriefSummary="这种水晶是制造某些合金过程中稀有杂质结合以及一些偶然外部条件的奇特副产品，它会产生强烈燃烧的光刃。"
TinySummary=""

[UpgradePontiteCrystal_Adv X2WeaponUpgradeTemplate]
FriendlyName="芒修特水晶"
FriendlyNamePlural="芒修特水晶"
BriefSummary="这种水晶是阿德根水晶的稀有品种之一。它能散发出强大的光环，可为你和周围人冷却止血和安抚精神（？）。"
TinySummary=""

[UpgradeQixoniCrystal_Sup X2WeaponUpgradeTemplate]
FriendlyName="奇诺尼水晶"
FriendlyNamePlural="奇诺尼水晶"
BriefSummary="这种水晶形成于千年前因恒星变成超新星而毁灭的行星上。它们极其稀有，威力巨大。"
TinySummary=""

[UpgradeRubatCrystal_Bsc X2WeaponUpgradeTemplate]
FriendlyName="鲁巴特水晶"
FriendlyNamePlural="鲁巴特水晶"
BriefSummary="这种水晶开采于菲米斯，可用来制造光剑。它能产生清晰轮廓的光刃，让绝地轻松跟踪轨迹，以更容易击中对手。"
TinySummary=""

[UpgradeRuusanCrystal_Bsc X2WeaponUpgradeTemplate]
FriendlyName="鲁珊水晶"
FriendlyNamePlural="鲁珊水晶"
BriefSummary="这种水晶来自于同名的中环行星。虽然缺少直接影响光剑的效能，但它们可帮助绝地凝聚原力。"
TinySummary=""

[UpgradeSapithCrystal_Adv X2WeaponUpgradeTemplate]
FriendlyName="萨皮斯水晶"
FriendlyNamePlural="萨皮斯水晶"
BriefSummary="这种结晶物质由卢赫克已灭绝的古老沃利斯虫每11年分泌而来。它会产生更强烈的光刃，使你更好的控制。"
TinySummary=""

[UpgradeSigilCrystal_Bsc X2WeaponUpgradeTemplate]
FriendlyName="希吉尔水晶"
FriendlyNamePlural="希吉尔水晶"
BriefSummary="这种水晶开采于希吉尔星系，是贵而有所值的光剑配件。它会产生强烈的光刃，令接触者灼伤，造成巨大伤害。"
TinySummary=""

[UpgradeSolariCrystal_Sup X2WeaponUpgradeTemplate]
FriendlyName="索拉里水晶"
FriendlyNamePlural="索拉里水晶"
BriefSummary="这种有光明面原力的人工物质，是闪闪发光的白色宝石，只有精神纯洁的绝地武士才可使用它制造的光剑。"
TinySummary=""

[UpgradeStygiumCrystal_Adv X2WeaponUpgradeTemplate]
FriendlyName="施泰什水晶"
FriendlyNamePlural="施泰什水晶"
BriefSummary="这种晶体形态纯净，是适合制造光剑的材料。施泰什矿物可用来造成伪装效果，骗过敌人的传感器。"
TinySummary=""

[UpgradeUltimaPearl_Sup X2WeaponUpgradeTemplate]
FriendlyName="阿尔蒂马宝珠"
FriendlyNamePlural="阿尔蒂马宝珠"
BriefSummary="这种稀有的石头可在卡拉马里找到，是罕有人用的光剑凝聚水晶。它珍贵而威力强大，很难正确地装进光剑。"
TinySummary=""

[UpgradeUpariCrystal_Adv X2WeaponUpgradeTemplate]
FriendlyName="乌帕里晶体"
FriendlyNamePlural="乌帕里晶体"
BriefSummary="奇怪的是，这种水晶通常散落在森林区域为主的天体轨道上。它很脆而用途广泛，绝地大师可用它产生多种效果。"
TinySummary=""

[UpgradeVelmoriteCrystal_Adv X2WeaponUpgradeTemplate]
FriendlyName="维莫尔特水晶"
FriendlyNamePlural="维莫尔特水晶"
BriefSummary="这种晶体只能在维莫尔星球上找到，它会产生非常纤细的光刃，让你很容易熟练地使用。"
TinySummary=""

[UpgradeDiatiumCell_Bsc X2WeaponUpgradeTemplate]
FriendlyName="迪亚特素电池"
FriendlyNamePlural="迪亚特素电池"
BriefSummary="这种动力电池可改变光剑的能量输出，让熟练的使用者更好地发动强大的攻击。"
TinySummary="增加伤害"

[UpgradeDiatiumCell_Adv X2WeaponUpgradeTemplate]
FriendlyName="升级迪亚特素电池"
FriendlyNamePlural="升级迪亚特素电池"
BriefSummary="这种动力电池可改变光剑的能量输出，让熟练的使用者更好地发动强大的攻击。"
TinySummary="增加伤害"

[UpgradeDiatiumCell_Sup X2WeaponUpgradeTemplate]
FriendlyName="高级迪亚特素电池"
FriendlyNamePlural="高级迪亚特素电池"
BriefSummary="这种动力电池可改变光剑的能量输出，让熟练的使用者更好地发动强大的攻击。"
TinySummary="增加伤害"

[UpgradeDiatiumCell_Ult X2WeaponUpgradeTemplate]
FriendlyName="终极迪亚特素电池"
FriendlyNamePlural="终极迪亚特素电池"
BriefSummary="这种动力电池可改变光剑的能量输出，让熟练的使用者更好地发动强大的攻击。"
TinySummary="增加伤害"

[UpgradeDischargeCell_Bsc X2WeaponUpgradeTemplate]
FriendlyName="放电能量电池"
FriendlyNamePlural="放电能量电池"
BriefSummary="这种动力电池可改变光剑的能量输出，让精准的使用者更好地发动强大的攻击。"
TinySummary="增加暴击伤害"

[UpgradeDischargeCell_Adv X2WeaponUpgradeTemplate]
FriendlyName="升级放电能量电池"
FriendlyNamePlural="升级放电能量电池"
BriefSummary="这种动力电池可改变光剑的能量输出，让精准的使用者更好地发动强大的攻击。"
TinySummary="增加暴击伤害"

[UpgradeDischargeCell_Sup X2WeaponUpgradeTemplate]
FriendlyName="高级放电能量电池"
FriendlyNamePlural="高级放电能量电池"
BriefSummary="这种动力电池可改变光剑的能量输出，让精准的使用者更好地发动强大的攻击。"
TinySummary="增加暴击伤害"

[UpgradeIonCell_Bsc X2WeaponUpgradeTemplate]
FriendlyName="离子能量电池"
FriendlyNamePlural="离子能量电池"
BriefSummary="这种动力电池可改变光剑的能量输出，让熟练的使用者更好地发动破坏性的攻击。"
TinySummary="增加穿甲"

[UpgradeIonCell_Adv X2WeaponUpgradeTemplate]
FriendlyName="升级离子能量电池"
FriendlyNamePlural="升级离子能量电池"
BriefSummary="这种动力电池可改变光剑的能量输出，让熟练的使用者更好地发动破坏性的攻击。"
TinySummary="增加穿甲"

[UpgradeIonCell_Sup X2WeaponUpgradeTemplate]
FriendlyName="高级离子能量电池"
FriendlyNamePlural="高级离子能量电池"
BriefSummary="这种动力电池可改变光剑的能量输出，让熟练的使用者更好地发动破坏性的攻击。"
TinySummary="增加穿甲"

[UpgradeJoltCell_Bsc X2WeaponUpgradeTemplate]
FriendlyName="震击能量电池"
FriendlyNamePlural="震击能量电池"
BriefSummary="这种动力电池可以改变光剑的能量输出，让熟练的使用者更好地进行精确攻击。"
TinySummary="增加暴击率"

[UpgradeJoltCell_Adv X2WeaponUpgradeTemplate]
FriendlyName="升级震击能量电池"
FriendlyNamePlural="升级震击能量电池"
BriefSummary="这种动力电池可以改变光剑的能量输出，让熟练的使用者更好地进行精确攻击。"
TinySummary="增加暴击率"

[UpgradeJoltCell_Sup X2WeaponUpgradeTemplate]
FriendlyName="高级震击能量电池"
FriendlyNamePlural="高级震击能量电池"
BriefSummary="这种动力电池可以改变光剑的能量输出，让熟练的使用者更好地进行精确攻击。"
TinySummary="增加暴击率"

[UpgradeFocusEmitter_Bsc X2WeaponUpgradeTemplate]
FriendlyName="聚能放射器"
FriendlyNamePlural="聚能放射器"
BriefSummary="聚能放射器可将剑刃变得更薄、更有威力，让熟练的使用者更好地发动强大的攻击。"
TinySummary="增加伤害"

[UpgradeFocusEmitter_Adv X2WeaponUpgradeTemplate]
FriendlyName="升级聚能放射器"
FriendlyNamePlural="升级聚能放射器"
BriefSummary="聚能放射器可将剑刃变得更薄、更有威力，让熟练的使用者更好地发动强大的攻击。"
TinySummary="增加伤害"

[UpgradeFocusEmitter_Sup X2WeaponUpgradeTemplate]
FriendlyName="高级聚能放射器"
FriendlyNamePlural="高级聚能放射器"
BriefSummary="聚能放射器可将剑刃变得更薄、更有威力，让熟练的使用者更好地发动强大的攻击。"
TinySummary="增加伤害"

[UpgradeDisruptEmitter_Bsc X2WeaponUpgradeTemplate]
FriendlyName="碎甲放射器"
FriendlyNamePlural="碎甲放射器"
BriefSummary="碎甲发射器可产生不稳定的光刃，对受害者的保护外壳或盔甲造成严重破坏。"
TinySummary="增加碎甲"

[UpgradeDisruptEmitter_Adv X2WeaponUpgradeTemplate]
FriendlyName="升级碎甲放射器"
FriendlyNamePlural="升级碎甲放射器"
BriefSummary="碎甲发射器可产生不稳定的光刃，对受害者的保护外壳或盔甲造成严重破坏。"
TinySummary="增加碎甲"

[UpgradeDisruptEmitter_Sup X2WeaponUpgradeTemplate]
FriendlyName="高级碎甲放射器"
FriendlyNamePlural="高级碎甲放射器"
BriefSummary="碎甲发射器可产生不稳定的光刃，对受害者的保护外壳或盔甲造成严重破坏。"
TinySummary="增加碎甲"

[UpgradePhobiumEmitter_Bsc X2WeaponUpgradeTemplate]
FriendlyName="费比姆放射器"
FriendlyNamePlural="费比姆放射器"
BriefSummary="费比姆放射器专为更加好斗的战士设计。与普通放射器相比，它产生的光刃更宽、更厚，当然也更有威力。"
TinySummary="增加暴击率"

[UpgradePhobiumEmitter_Adv X2WeaponUpgradeTemplate]
FriendlyName="升级费比姆放射器"
FriendlyNamePlural="升级费比姆放射器"
BriefSummary="费比姆放射器专为更加好斗的战士设计。与普通放射器相比，它产生的光刃更宽、更厚，当然也更有威力。"
TinySummary="增加暴击率"

[UpgradePhobiumEmitter_Sup X2WeaponUpgradeTemplate]
FriendlyName="高级费比姆放射器"
FriendlyNamePlural="高级费比姆放射器"
BriefSummary="费比姆放射器专为更加好斗的战士设计。与普通放射器相比，它产生的光刃更宽、更厚，当然也更有威力。"
TinySummary="增加暴击率"

[UpgradePhobiumEmitter_Ult X2WeaponUpgradeTemplate]
FriendlyName="终极费比姆放射器"
FriendlyNamePlural="终极费比姆放射器"
BriefSummary="费比姆放射器专为更加好斗的战士设计。与普通放射器相比，它产生的光刃更宽、更厚，当然也更有威力。"
TinySummary="增加暴击率"

[UpgradeFencingEmitter_Bsc X2WeaponUpgradeTemplate]
FriendlyName="击剑放射器"
FriendlyNamePlural="击剑放射器"
BriefSummary="击剑放射器尤其适合那些希望一击克敌的人。"
TinySummary="增加暴击伤害"

[UpgradeFencingEmitter_Adv X2WeaponUpgradeTemplate]
FriendlyName="升级击剑放射器"
FriendlyNamePlural="升级击剑放射器"
BriefSummary="击剑放射器尤其适合那些希望一击克敌的人。"
TinySummary="增加暴击伤害"

[UpgradeFencingEmitter_Sup X2WeaponUpgradeTemplate]
FriendlyName="高级击剑放射器"
FriendlyNamePlural="高级击剑放射器"
BriefSummary="击剑放射器尤其适合那些希望一击克敌的人。"
TinySummary="增加暴击伤害"

[UpgradeBeamGemLens_Bsc X2WeaponUpgradeTemplate]
FriendlyName="光束宝石透镜"
FriendlyNamePlural="光束宝石透镜"
BriefSummary="光束宝石晶体的名字恰如其分，它在使用光学计算机的例如导航系统中很常见。毫不奇怪，它们也能产生高度集中的光剑光束。"
TinySummary="增加伤害"

[UpgradeBeamGemLens_Adv X2WeaponUpgradeTemplate]
FriendlyName="升级光束宝石透镜"
FriendlyNamePlural="升级光束宝石透镜"
BriefSummary="光束宝石晶体的名字恰如其分，它在使用光学计算机的例如导航系统中很常见。毫不奇怪，它们也能产生高度集中的光剑光束。"
TinySummary="增加伤害"

[UpgradeBeamGemLens_Sup X2WeaponUpgradeTemplate]
FriendlyName="高级光束宝石透镜"
FriendlyNamePlural="高级光束宝石透镜"
BriefSummary="光束宝石晶体的名字恰如其分，它在使用光学计算机的例如导航系统中很常见。毫不奇怪，它们也能产生高度集中的光剑光束。"
TinySummary="增加伤害"

[UpgradeByrothsisLens_Bsc X2WeaponUpgradeTemplate]
FriendlyName="拜尔斯透镜"
FriendlyNamePlural="拜尔斯透镜"
BriefSummary="拜尔斯最初用于最初用于制造红外摄像机镜头，但后来被用于其他用途，包括光剑透镜。"
TinySummary="增加碎甲"

[UpgradeByrothsisLens_Adv X2WeaponUpgradeTemplate]
FriendlyName="升级拜尔斯透镜"
FriendlyNamePlural="升级拜尔斯透镜"
BriefSummary="拜尔斯最初用于最初用于制造红外摄像机镜头，但后来被用于其他用途，包括光剑透镜。"
TinySummary="增加碎甲"

[UpgradeByrothsisLens_Sup X2WeaponUpgradeTemplate]
FriendlyName="高级拜尔斯透镜"
FriendlyNamePlural="高级拜尔斯透镜"
BriefSummary="拜尔斯最初用于最初用于制造红外摄像机镜头，但后来被用于其他用途，包括光剑透镜。"
TinySummary="增加碎甲"

[UpgradeDuelingLens_Bsc X2WeaponUpgradeTemplate]
FriendlyName="决斗透镜"
FriendlyNamePlural="决斗透镜"
BriefSummary="决斗透镜可将光剑凝聚成精确调整的光刃，用于决斗和其他需要完全掌控的场合。"
TinySummary="增加穿甲"

[UpgradeDuelingLens_Adv X2WeaponUpgradeTemplate]
FriendlyName="升级决斗透镜"
FriendlyNamePlural="升级决斗透镜"
BriefSummary="决斗透镜可将光剑凝聚成精确调整的光刃，用于决斗和其他需要完全掌控的场合。"
TinySummary="增加穿甲"

[UpgradeDuelingLens_Sup X2WeaponUpgradeTemplate]
FriendlyName="高级决斗透镜"
FriendlyNamePlural="高级决斗透镜"
BriefSummary="决斗透镜可将光剑凝聚成精确调整的光刃，用于决斗和其他需要完全掌控的场合。"
TinySummary="增加穿甲"

[UpgradeDuelingLens_Ult X2WeaponUpgradeTemplate]
FriendlyName="终极决斗透镜"
FriendlyNamePlural="终极决斗透镜"
BriefSummary="决斗透镜可将光剑凝聚成精确调整的光刃，用于决斗和其他需要完全掌控的场合。"
TinySummary="增加穿甲"

[UpgradeVibrationLens_Bsc X2WeaponUpgradeTemplate]
FriendlyName="振动透镜"
FriendlyNamePlural="振动透镜"
BriefSummary="这种透镜能产生飞速振动，形成能量不稳定的光刃，但更致命。"
TinySummary="增加暴击伤害和碎甲"

[UpgradeVibrationLens_Adv X2WeaponUpgradeTemplate]
FriendlyName="升级振动透镜"
FriendlyNamePlural="升级振动透镜"
BriefSummary="这种透镜能产生飞速振动，形成能量不稳定的光刃，但更致命。"
TinySummary="增加暴击伤害和碎甲"

[UpgradeVibrationLens_Sup X2WeaponUpgradeTemplate]
FriendlyName="高级振动透镜"
FriendlyNamePlural="高级振动透镜"
BriefSummary="这种透镜能产生飞速振动，形成能量不稳定的光刃，但更致命。"
TinySummary="增加暴击伤害和碎甲"

[Lightsaber_CV_Project X2TechTemplate]
DisplayName="学徒光剑"
Summary="随着原力相关能力的发现，我们应该研发一种武器，帮助有天赋者运用能力。与灵能增幅器类似，这些“光剑”将进行一系列凝聚调整，并用与变种人武器不同的凝聚晶体来产生光束。" 

[Lightsaber_MG_Project X2TechTemplate]
DisplayName="武士光剑"
Summary="随着变种人和外星人势力的日益强大，我们有必要制造一种新的绝地武器。虽然它基本上与之前版本相同 —— 考虑到内部的可切换组件提供了大部分的有形益处 —— 但重新设计的外壳本身应该能在攻击时增强控制力。" 

[Lightsaber_BM_Project X2TechTemplate]
DisplayName="大师光剑"
Summary="利用对精通灵能的变种人和外星人力量的研究中学到的新技术，我们相信光剑技术有了新的探索途径。和以前一样，获益可能很小，但有任何获益总比没有好。" 


[Saberstaff_CV_Project X2TechTemplate]
DisplayName="学徒剑杖"
Summary="随着原力相关能力的发现，我们应该研发一种武器，帮助有天赋者运用能力。与灵能增幅器类似，这些“光剑”将进行一系列凝聚调整，并用与变种人武器不同的凝聚晶体来产生光束。" 

[Saberstaff_MG_Project X2TechTemplate]
DisplayName="武士剑杖"
Summary="随着变种人和外星人势力的日益强大，我们有必要制造一种新的绝地武器。虽然它基本上与之前版本相同 —— 考虑到内部的可切换组件提供了大部分的有形益处 —— 但重新设计的外壳本身应该能在攻击时增强控制力。" 

[Saberstaff_BM_Project X2TechTemplate]
DisplayName="大师剑杖"
Summary="利用对精通灵能的变种人和外星人力量的研究中学到的新技术，我们相信光剑技术有了新的探索途径。和以前一样，获益可能很小，但有任何获益总比没有好。" 